{
  "architectures": [
    "JambaForCausalLM"
  ],
  "attention_dropout": 0.0,
  "attn_layer_offset": 4,
  "attn_layer_period": 8,
  "auto_map": {
    "AutoConfig": "configuration_jamba.JambaConfig",
    "AutoModel": "modeling_jamba.JambaModel",
    "AutoModelForCausalLM": "modeling_jamba.JambaForCausalLM",
    "AutoModelForSequenceClassification": "model.JambaForSequenceClassification"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "expert_layer_offset": 1,
  "expert_layer_period": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "mamba_conv_bias": true,
  "mamba_d_conv": 4,
  "mamba_d_state": 16,
  "mamba_dt_rank": 256,
  "mamba_expand": 2,
  "mamba_inner_layernorms": true,
  "mamba_proj_bias": false,
  "model_type": "jamba",
  "n_ctx": 262144,
  "num_attention_heads": 32,
  "num_experts": 16,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "output_router_logits": false,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.0.dev0",
  "use_cache": true,
  "use_mamba_kernels": false,
  "vocab_size": 65536
}